In [8]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error

In [22]:
df1 = pd.read_csv('1- producao-de-plastico-global.csv')
df2 = pd.read_csv('5- poluicao-agua-cidades.csv')

In [26]:
df2.rename(columns={' Entidade': 'Entidade'}, inplace=True)

In [27]:
# Verificar se há valores nulos na coluna "Entidade"
print("\nValores nulos em df1['Entidade']:", df1['Entidade'].isnull().sum())
print("Valores nulos em df2['Entidade']:", df2['Entidade'].isnull().sum())

Valores nulos em df1['Entidade']: 0
Valores nulos em df2['Entidade']: 0

In [30]:
df1.head()

  Entidade   Ano  Produção Anual de Plástico
0    Mundo  1950                     2000000
1    Mundo  1951                     2000000
2    Mundo  1952                     2000000
3    Mundo  1953                     3000000
4    Mundo  1954                     3000000

In [31]:
df2.head()

,Cidade,Região,Entidade,Qualidade do Ar,Poluição da Água
0,New York City,New York,United States of America,46.816038,49.504950
1,"Washington, D.C.",District of Columbia,United States of America,66.129032,49.107143
2,San Francisco,California,United States of America,60.514019,43.000000
3,Berlin,NaN,Germany,62.364130,28.612717
4,Los Angeles,California,United States of America,36.621622,61.299435

In [39]:
df_merged = pd.merge(df1, df2, on='Entidade', how='right')

In [41]:
df_merged.head()

,Entidade,Ano,Produção Anual de Plástico,Cidade,Região,Qualidade do Ar,Poluição da Água
0,United States of America,NaN,NaN,New York City,New York,46.816038,49.504950
1,United States of America,NaN,NaN,"Washington, D.C.",District of Columbia,66.129032,49.107143
2,United States of America,NaN,NaN,San Francisco,California,60.514019,43.000000
3,Germany,NaN,NaN,Berlin,NaN,62.364130,28.612717
4,United States of America,NaN,NaN,Los Angeles,California,36.621622,61.299435

In [42]:
df_merged.drop(columns=['Ano', 'Produção Anual de Plástico'], inplace=True)

In [48]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3963 entries, 0 to 3962
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Entidade           3963 non-null   object
 1   Cidade             3963 non-null   object
 2    Região            3538 non-null   object
 3    Qualidade do Ar   3963 non-null   float64
 4    Poluição da Água  3963 non-null   float64
dtypes: float64(2), object(3)
memory usage: 154.9+ KB

In [50]:
X = df_merged[[' Poluição da Água']]
y = df_merged[' Qualidade do Ar']

In [53]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

In [54]:
model = LinearRegression()

# Treinando o modelo
model.fit(X_train, y_train)

# Fazendo previsões
y_pred = model.predict(X_test)

# Calculando o erro médio quadrado (MSE)
mse = mean_squared_error(y_test, y_pred)

# Exibindo os resultados
print(f'Coeficiente de determinação (R²): {model.score(X_test, y_test):.2f}')
print(f'Erro médio quadrado (MSE): {mse:.2f}')

Coeficiente de determinação (R²): 0.20
Erro médio quadrado (MSE): 792.27